Revit 2024 API
View3D.ResetCameraTarget Method
 Resets the camera target to the center of the field of view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015 Subscription Update
Syntax
C#
public void ResetCameraTarget()
Visual Basic
Public Sub ResetCameraTarget
Visual C++
public:
void ResetCameraTarget()
Remarks
 The camera target can only be reset for perspective view.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The camera target cannot be reset for the view.
See Also
View3D Class
Autodesk.Revit.DB Namespace